print('Задача 7. Режем число на части')

# Реализуйте программу,
# которая получает на вход четырёхзначное число
# и выводит на экран каждую его цифру отдельно
# (в одну строчку либо каждая цифра в новой строчке).
# Само число при этом изменять нельзя, то есть нужно обойтись без переприсваивания.
# Однако можно использовать сколько угодно переменных

# a = int(input("Четырехзначное число: "))
a = input("Четырехзначное число: ")

print("Вы ввели числа:", a[0], a[1], a[2], a[3])
# print("Вы ввели числа:", a // 1000, a // 100 % 10, a // 10 % 10, a % 10)
