print('Задача 4. Площадь треугольника')

# Напишите программу,
# которая запрашивает у пользователя длины двух катетов
# в прямоугольном треугольнике и выводит его площадь.

# Формула:
# S = ab/2

a = int(input("Первый катет: "))
b = int(input("Второй катет: "))

print("Площадь:", (a * b) / 2)
